[
  {
    "name": "Swiss Cheese Plant",
    "scientific_name": "Monstera deliciosa",
    "description": "A tropical vine known for its large, glossy leaves with characteristic holes.",
    "long_description": "The Swiss Cheese Plant is a popular tropical plant native to the rainforests of Central America. It thrives in warm, humid conditions and is often used as a decorative houseplant due to its striking appearance. The plant’s leaves are large, heart-shaped, and develop holes or slits as they mature, which is an adaptation to withstand heavy rainfall and wind in its natural habitat. The plant produces edible fruit that has a taste similar to pineapple and banana. It requires indirect sunlight and moist soil for optimal growth. In homes, it can grow to a height of 3 to 4 meters if provided with support. The plant’s aerial roots can absorb moisture and nutrients from the air, making it suitable for climbing. Regular pruning helps maintain its shape. The Swiss Cheese Plant is toxic to pets if ingested. Its unique appearance makes it a favorite among plant enthusiasts."
  },
  {
    "name": "Bird of Paradise",
    "scientific_name": "Strelitzia reginae",
    "description": "A striking plant known for its colorful, bird-like flowers.",
    "long_description": "Bird of Paradise is an iconic tropical plant native to South Africa, but it is widely cultivated in tropical and subtropical regions around the world. Its distinctive flowers resemble a brightly colored bird in flight, hence the name. The plant grows well in both gardens and pots, making it a versatile choice for landscaping. The leaves are large, glossy, and paddle-shaped, similar to those of a banana plant. It requires bright, indirect sunlight and well-drained soil for healthy growth. During the flowering season, which typically lasts several months, the plant produces flowers in shades of orange, blue, and purple. The Bird of Paradise can reach a height of 1.5 to 2 meters and benefits from regular feeding during the growing season. It is relatively drought-tolerant once established but prefers consistent watering. This plant is considered non-toxic to humans but mildly toxic to pets. It symbolizes freedom and paradise in various cultures."
  },
  {
    "name": "Frangipani",
    "scientific_name": "Plumeria rubra",
    "description": "A tropical tree known for its fragrant, colorful flowers.",
    "long_description": "Frangipani is a small tropical tree native to Central America, known for its beautiful, fragrant flowers that bloom in clusters. The flowers come in a range of colors, including white, yellow, pink, and red, with a distinct sweet fragrance. Frangipani trees can grow up to 6 meters in height and have a spreading growth habit, making them ideal for use as shade trees in gardens. The tree thrives in well-draining soil and prefers full sunlight. It is drought-tolerant once established but benefits from regular watering during hot, dry periods. Pruning helps maintain its shape and encourages flowering. The plant has thick, fleshy branches and a milky sap that can irritate the skin. In many cultures, the flowers are used in traditional ceremonies and leis. The tree is also known to attract pollinators like bees and butterflies. Despite its tropical origins, Frangipani can tolerate mild frost. It grows well in coastal areas due to its salt tolerance."
  },
  {
    "name": "Croton",
    "scientific_name": "Codiaeum variegatum",
    "description": "A colorful tropical shrub with variegated leaves.",
    "long_description": "Croton is a tropical shrub native to Southeast Asia and the Pacific Islands, known for its vibrant foliage. The leaves display a wide range of colors, including green, yellow, orange, red, and purple, often in striking patterns. Croton is a popular choice for both indoor and outdoor decoration due to its bold appearance. It grows best in well-drained soil and bright, indirect sunlight. The plant requires high humidity and consistent moisture but should not be overwatered, as it is susceptible to root rot. Croton can reach a height of up to 1.5 meters and benefits from regular feeding during the growing season. Pruning helps maintain its compact shape and encourages new growth. The plant produces small, inconspicuous flowers but is primarily grown for its leaves. It is toxic if ingested, so caution should be taken around pets and children. Croton’s striking colors can brighten up any space, making it a favorite among gardeners and interior decorators."
  }
]