[
  {
    "name": "White Water Lily",
    "scientific_name": "Nymphaea alba",
    "description": "A floating aquatic plant with round leaves and white flowers.",
    "long_description": "The White Water Lily is a beautiful aquatic plant found in freshwater ponds, lakes, and slow-moving rivers across Europe and parts of Asia. It is known for its large, round leaves that float on the water’s surface and its striking white flowers, which open during the day and close at night. The plant’s root system is anchored in the muddy bottom, while its leaves and flowers float freely. White Water Lilies play a crucial role in wetland ecosystems by providing shade, which helps regulate water temperature and prevent algae growth. They also offer shelter and breeding grounds for aquatic insects, fish, and amphibians. The plant prefers calm, nutrient-rich water and can grow in depths of up to 2 meters. In addition to its ecological importance, the White Water Lily is often used in water gardens and ponds for ornamental purposes. Its flowers are also symbolic in many cultures, representing purity and peace."
  },
  {
    "name": "Yellow Flag Iris",
    "scientific_name": "Iris pseudacorus",
    "description": "A tall wetland plant with bright yellow flowers.",
    "long_description": "The Yellow Flag Iris is a perennial wetland plant native to Europe, Asia, and North Africa. It thrives in marshes, ditches, and along riverbanks, where its striking yellow flowers stand out during the spring and summer. The plant can grow up to 1.5 meters tall, with long, sword-like leaves that are green and glossy. Yellow Flag Iris is often used in constructed wetlands and wastewater treatment systems due to its ability to absorb excess nutrients and pollutants from the water. It spreads rapidly through rhizomes, forming dense colonies that help stabilize soil and prevent erosion. While it provides habitat for various wetland species, it can become invasive in some regions. The plant prefers full sun to partial shade and moist to waterlogged soil. Yellow Flag Iris is toxic if ingested, so caution is advised when planting it near livestock or pets."
  }
]